/*
 * File: F_DEC_VT.c
 *
 * MATLAB Coder version            : 4.2
 * C/C++ source code generated on  : 09-Mar-2021 11:06:48
 */

/* Include Files */
#include <math.h>
//#include "F_DEC_VT.h"

/* Function Definitions */

/*
 * Arguments    : double v0
 *                double v1
 * Return Type  : double
 */
double F_DEC_VT(double v0, double v1)
{
  double T_section_tmp;
  double b_T_section_tmp;
  double c_T_section_tmp;
  double d_T_section_tmp;

  /*  1表示分段积分的第1个积分 */
  /*  2表示第2种情况，制动一共6种 */
  /*  1表示分段积分的第1个积分 */
  /*  2表示第2种情况，制动一共6种 */
  /*  1表示分段积分的第1个积分 */
  /*  1表示分段积分的第1个积分 */
  /*  */
  /* (x>=294&y<=70) */
  /*  */
  /* (x>=70&x<=294&y<=70) */
  /* (x<=70) */
  /* z=(diff2).*(x>=294&y>=70&y<=294)+(diff3).*(x>=294&y<70)+(diff4).*(x>=70&x<=294&y>=70)+(diff5).*(x>=70&x<=294&y<70)+(diff6).*(x<70); */
  T_section_tmp = 2.8565928956451166E+7 * atan(-0.000482049047917562 * (v0 / 3.6)
    / 7.00134766507683E-8 + 130372.82331617414);
  b_T_section_tmp = -2.9665158475312E-5 * (v1 / 3.6) / 0.000770194914121439;
  c_T_section_tmp = 2596.7452697105891 * atan(-2.9665158475312E-5 * (v0 / 3.6) /
    0.000770194914121439 + 11.851356655027825);
  d_T_section_tmp = 54.161872796748625 * atan(-0.000633934345342712 * (v1 / 3.6)
    / 0.0369263449863584 + 0.24678369939074651);
  return (((((2.8565928956451166E+7 * atan(-0.000482049047917562 * (v1 / 3.6) /
    7.00134766507683E-8 + 130372.82331617414) - T_section_tmp) * (double)(v1 >=
              294.0) + (((-4.4871190137583412E+7 - T_section_tmp) +
    2596.7452697105891 * atan(b_T_section_tmp + 11.855672037028576)) -
                        3782.1293555997213) * (double)((v0 >= 294.0) && (v1 >=
    70.0) && (v1 <= 294.0))) + ((((-4.4871190137583412E+7 -
    2.8565928956451166E+7 * atan(-0.000482049047917562 * (v0 / 3.6) /
    7.00134766507683E-8 + 130372.82331617414)) + 63.65825456943594) +
              d_T_section_tmp) - -4.701833522765865) * (double)((v0 >= 294.0) &&
             (v1 < 70.0))) + (2596.7452697105891 * atan(b_T_section_tmp +
             11.851356655027825) - c_T_section_tmp) * (double)((v0 >= 70.0) &&
            (v0 <= 294.0) && (v1 >= 70.0))) + (((3845.7876101691572 -
             c_T_section_tmp) + d_T_section_tmp) - -4.701833522765865) * (double)
          ((v0 >= 70.0) && (v0 <= 294.0) && (v1 < 70.0))) + (d_T_section_tmp -
    54.161872796748625 * atan(-0.000633934345342712 * (v0 / 3.6) /
    0.0369263449863584 + 0.24719085044874545)) * (double)(v0 < 70.0);
}

/*
 * File trailer for F_DEC_VT.c
 *
 * [EOF]
 */
